Revit 2026 API

# HorizontalCurveEndpoint Class

---

Represents an endpoint (start or end) of a horizontal curve in Alignment geometry.

SystemObject Autodesk.Revit.DB.InfrastructureHorizontalCurveEndpoint

**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HorizontalCurveEndpoint
```
```vb
Public Class HorizontalCurveEndpoint
```
```cpp
public ref class HorizontalCurveEndpoint
```
```fsharp
type HorizontalCurveEndpoint = class end
```

The HorizontalCurveEndpoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NextCurveType | The HorizontalCurveType of the curve which connects the endpoint to the next displayed curve. If this endpoint's Station equals DisplayedEndStation, returns Unknown curve type. |
|  | PreviousCurveType | The HorizontalCurveType of the curve which connects the endpoint to the previous displayed curve. If this endpoint's Station equals DisplayedStartStation, returns Unknown curve type. |
|  | Station | The endpoint's station value. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Infrastructure Namespace